                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  //设圆半径r=1.5 , 圆柱高 3 , 求圆周长,圆面积,圆球表面积,圆球体积,圆柱体积
//输入一个字符,判断它是否为大写字母,如果是,将它转换成小写字母;如果不是,不转换.
#include <stdio.h>

int main()
{
    char i;
    printf("请输入一个字符\n");
    scanf("%c",&i);
//    if(i >= 'A' & i <= 'Z')
//    {
//        i = i+32;
//    }
    i = (i >= 'A' & i <= 'Z')?(i+32):i;
    printf("%c\n",i);
    return 0;

}
