//1000元存五年
/*  (1)一次存五年期
    (2)先存两年期,到期后再把本息再存三年期
    (3)先存三年期,到期后再把本息再存两年期
    (4)存一年期,到期后将本息再存一年期,连续存五次
    (5)存活期存款.活期利息每一季度结算一次

一年定期存款利息 1.5%
两年定期存款利息 2.1%
三年定期存款利息 2.75%
五年定期存款利息 3%
活期存款利息 0.35%


*/
#include <stdio.h>
#include <math.h>

int main()
{
    float i = 1000.0;
//    (1)一次存五年期
    float p1 = 0;
    p1 = i*(1.0+5.0*0.03);
    printf("一次存五年期的钱为\t%f\n",p1);
//    (2)先存两年期,到期后再把本息再存三年期
    float p2 = 0;
    p2 = (i*(1.0+2.0*0.021))*(1.0+3.0*0.0275);
    printf("先存两年期,到期后再把本息再存三年期的钱为\t%f\n",p2);
//    (3)先存三年期,到期后再把本息再存两年期
    float p3 = 0;
    p3 = (i*(1.0+3.0*0.0275))*(1.0+2.0*0.021);
    printf("先存三年期,到期后再把本息再存两年期的钱为\t%f\n",p3);
//    (4)存一年期,到期后将本息再存一年期,连续存五次
    float p4 = 0;
    int k = 0;
    float k1=1000;
    for(k=1;k<=5;k++)
    {

        p4 = k1*(1.0+0.015);
        k1 = p4;
    }
    printf("存一年期,到期后将本息再存一年期,连续存五次的钱为\t%f\n",p4);
//    (5)存活期存款.活期利息每一季度结算一次
    float p5 = 0;
    p5 = i*pow((1+0.0035/4),4*5);
    printf("存活期存款.活期利息每一季度结算一次的钱为\t%f\n",p5);
    return 0;

}
